{
  "Saved_data" : [
    {
      "id": "1",
      "cmp_img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ9aZLSIxNZv3FSEhMQjmSUzORZWmUPTz4WGA&s",
      "company": "Infosys",
      "job_role": "Software_developer",
      "description": {
        "job-summary": "We are looking for a skilled Web Developer to join our team and help build, maintain, and optimize modern web applications. The ideal candidate should have a strong understanding of front-end and back-end web technologies, be passionate about coding, and work well in a collaborative environment.",
        "key-responsibilities": "Develop, test, and maintain web applications using HTML, CSS, JavaScript, and modern frameworks. Build responsive and user-friendly websites that work across different devices and browsers. Collaborate with UI/UX designers to translate wireframes into functional web pages. Develop server-side applications and APIs using technologies like Node.js, PHP, Python, or Ruby on Rails. Optimize website performance for speed and scalability. Debug and troubleshoot issues to ensure smooth functionality. Implement security best practices to protect web applications from vulnerabilities.Work with databases such as MySQL, PostgreSQL, MongoDB, or Firebase. Stay up-to-date with the latest web development trends and technologies.",
        "required_Skills_and_Qualifications": "Strong proficiency in React.js, Next.js, Redux, and JavaScript/TypeScript. Experience with HTML, CSS (SASS, TailwindCSS), and responsive design. Knowledge of RESTful APIs and integration with backend services. Familiarity with state management libraries (Redux, Zustand, Recoil, etc.). Experience with version control systems like Git (GitHub/GitLab/Bitbucket). Knowledge of front-end build tools and package managers (Webpack, Vite, npm, Yarn). Understanding of performance optimization techniques for React applications. Experience with testing frameworks (Jest, React Testing Library, Cypress) is a plus. Familiarity with Agile development methodologies (Scrum/Kanban).",
        "PreferredQualifications": " Experience with Next.js for server-side rendering and static site generation. Familiarity with GraphQL (Apollo Client, Relay) is a plus. Understanding of CI/CD pipelines and deployment processes. Prior experience with cloud platforms (AWS, Firebase, Vercel, Netlify). Knowledge of UI/UX design principles and accessibility standards."
      },
      "location": "chennai",
      "salary": "6lpa"
    }
  ]
}
